ABOSTM/Arduino_Core_STM32/boards.txt
Disco.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Disco.menu.upload_method.swdMethod.upload.protocol=0
Disco.menu.upload_method.swdMethod.upload.options=-g
Disco.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
Disco.menu.upload_method.serialMethod.upload.protocol=1
Disco.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
Disco.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

Disco.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Disco.menu.upload_method.dfuMethod.upload.protocol=2
Disco.menu.upload_method.dfuMethod.upload.options=-g
Disco.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Eval boards

Eval.name=Eval

Eval.build.core=arduino
Eval.build.board=Eval
Eval.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# STEVAL_MKSBOX1V1 board
Eval.menu.pnum.STEVAL_MKSBOX1V1=SensorTile.box
Eval.menu.pnum.STEVAL_MKSBOX1V1.upload.maximum_size=2097152
Eval.menu.pnum.STEVAL_MKSBOX1V1.upload.maximum_data_size=655360
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.mcu=cortex-m4
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.board=STEVAL_MKSBOX1V1
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.series=STM32L4xx
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.product_line=STM32L4R9xx
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.variant=STM32L4xx/Generic_L4R9ZxJ
Eval.menu.pnum.STEVAL_MKSBOX1V1.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Upload menu
Eval.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
Eval.menu.upload_method.swdMethod.upload.protocol=0
Eval.menu.upload_method.swdMethod.upload.options=-g
Eval.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

Eval.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
Eval.menu.upload_method.dfuMethod.upload.protocol=2
Eval.menu.upload_method.dfuMethod.upload.options=-g
Eval.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# STM32MP1 microprocessor series (MPU + MCU)
STM32MP1.name=STM32MP1 series coprocessor

STM32MP1.build.core=arduino
STM32MP1.build.board=STM32MP1
STM32MP1.build.mcu=cortex-m4
STM32MP1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
STM32MP1.build.series=STM32MP1xx
STM32MP1.build.cmsis_lib_gcc=arm_cortexM4l_math
STM32MP1.build.extra_flags=-DCORE_CM4 -D{build.product_line} {build.enable_virtio} {build.xSerial}

# STM32MP157A-DK1 board
STM32MP1.menu.pnum.STM32MP157A_DK1=STM32MP157A-DK1
STM32MP1.menu.pnum.STM32MP157A_DK1.upload.maximum_size=131072
STM32MP1.menu.pnum.STM32MP157A_DK1.upload.maximum_data_size=131072
STM32MP1.menu.pnum.STM32MP157A_DK1.build.board=STM32MP157A_DK1
STM32MP1.menu.pnum.STM32MP157A_DK1.build.product_line=STM32MP157Axx
STM32MP1.menu.pnum.STM32MP157A_DK1.build.variant=STM32MP1xx/STM32MP157xACx

# STM32MP157C-DK2 board
STM32MP1.menu.pnum.STM32MP157C_DK2=STM32MP157C-DK2
STM32MP1.menu.pnum.STM32MP157C_DK2.upload.maximum_size=131072
STM32MP1.menu.pnum.STM32MP157C_DK2.upload.maximum_data_size=131072
STM32MP1.menu.pnum.STM32MP157C_DK2.build.board=STM32MP157C_DK2
STM32MP1.menu.pnum.STM32MP157C_DK2.build.product_line=STM32MP157Cxx
STM32MP1.menu.pnum.STM32MP157C_DK2.build.variant=STM32MP1xx/STM32MP157xACx

# Upload menu
STM32MP1.menu.upload_method.MassStorage=Generate run_arduino.sh (You need to copy this manually)
STM32MP1.menu.upload_method.MassStorage.upload.protocol=
STM32MP1.menu.upload_method.MassStorage.upload.tool=remoteproc_gen

###############################
# Generic F0
GenF0.name=Generic STM32F0 series

GenF0.build.core=arduino
GenF0.build.board=GenF0
GenF0.build.mcu=cortex-m0
GenF0.build.series=STM32F0xx
GenF0.build.cmsis_lib_gcc=arm_cortexM0l_math
GenF0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}

# DEMO_F030F4 board
GenF0.menu.pnum.DEMO_F030F4=STM32F030F4 Demo board (HSE 8Mhz)
GenF0.menu.pnum.DEMO_F030F4.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4.build.board=DEMO_F030F4
GenF0.menu.pnum.DEMO_F030F4.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4.build.variant=STM32F0xx/Generic_F030F4

# DEMO_F030F4_16M board
GenF0.menu.pnum.DEMO_F030F4_16M=STM32F030F4 Demo board (HSE 16Mhz)
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_16M.build.board=DEMO_F030F4_16M
GenF0.menu.pnum.DEMO_F030F4_16M.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_16M.build.variant=STM32F0xx/Generic_F030F4

# DEMO_F030F4_HSI board
GenF0.menu.pnum.DEMO_F030F4_HSI=STM32F030F4 Demo board (HSI internal RC oscillator)
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_size=16384
GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_data_size=4096
GenF0.menu.pnum.DEMO_F030F4_HSI.build.board=DEMO_F030F4_HSI
GenF0.menu.pnum.DEMO_F030F4_HSI.build.product_line=STM32F030x6
GenF0.menu.pnum.DEMO_F030F4_HSI.build.variant=STM32F0xx/Generic_F030F4

# Generic F030C8
GenF0.menu.pnum.GENERIC_F030C8=Generic F030C8
GenF0.menu.pnum.GENERIC_F030C8.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F030C8.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F030C8.build.board=GENERIC_F030C8
GenF0.menu.pnum.GENERIC_F030C8.build.product_line=STM32F030x8
GenF0.menu.pnum.GENERIC_F030C8.build.variant=STM32F0xx/Generic_F030C8

# Generic F030F4 board
GenF0.menu.pnum.GENERIC_F030F4=Generic F030F4
GenF0.menu.pnum.GENERIC_F030F4.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F030F4.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F030F4.build.board=GENERIC_F030F4
GenF0.menu.pnum.GENERIC_F030F4.build.product_line=STM32F030x6
GenF0.menu.pnum.GENERIC_F030F4.build.variant=STM32F0xx/Generic_F030F4

# Generic F030R8
GenF0.menu.pnum.GENERIC_F030R8=Generic F030R8
GenF0.menu.pnum.GENERIC_F030R8.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F030R8.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F030R8.build.board=GENERIC_F030R8
GenF0.menu.pnum.GENERIC_F030R8.build.product_line=STM32F030x8
GenF0.menu.pnum.GENERIC_F030R8.build.variant=STM32F0xx/Generic_F030R8

# Generic F031K6T
GenF0.menu.pnum.GENERIC_F031K6T=Generic F031K6T
GenF0.menu.pnum.GENERIC_F031K6T.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F031K6T.upload.maximum_data_size=4096
GenF0.menu.pnum.GENERIC_F031K6T.build.board=GENERIC_F031K6T
GenF0.menu.pnum.GENERIC_F031K6T.build.product_line=STM32F031x6
GenF0.menu.pnum.GENERIC_F031K6T.build.variant=STM32F0xx/Generic_F031K6T

# Generic F042C4
GenF0.menu.pnum.GENERIC_F042C4=Generic F042C4
GenF0.menu.pnum.GENERIC_F042C4.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F042C4.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C4.build.board=GENERIC_F042C4
GenF0.menu.pnum.GENERIC_F042C4.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C4.build.variant=STM32F0xx/Generic_F042Cx

# Generic F042C6
GenF0.menu.pnum.GENERIC_F042C6=Generic F042C6
GenF0.menu.pnum.GENERIC_F042C6.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F042C6.upload.maximum_data_size=6144
GenF0.menu.pnum.GENERIC_F042C6.build.board=GENERIC_F042C6
GenF0.menu.pnum.GENERIC_F042C6.build.product_line=STM32F042x6
GenF0.menu.pnum.GENERIC_F042C6.build.variant=STM32F0xx/Generic_F042Cx

# Generic F051K4U
GenF0.menu.pnum.GENERIC_F051K4U=Generic F051K4U
GenF0.menu.pnum.GENERIC_F051K4U.upload.maximum_size=16384
GenF0.menu.pnum.GENERIC_F051K4U.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051K4U.build.board=GENERIC_F051K4U
GenF0.menu.pnum.GENERIC_F051K4U.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051K4U.build.variant=STM32F0xx/Generic_F051KxU

# Generic F051K6U
GenF0.menu.pnum.GENERIC_F051K6U=Generic F051K6U
GenF0.menu.pnum.GENERIC_F051K6U.upload.maximum_size=32768
GenF0.menu.pnum.GENERIC_F051K6U.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051K6U.build.board=GENERIC_F051K6U
GenF0.menu.pnum.GENERIC_F051K6U.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051K6U.build.variant=STM32F0xx/Generic_F051KxU

# Generic F051K8U
GenF0.menu.pnum.GENERIC_F051K8U=Generic F051K8U
GenF0.menu.pnum.GENERIC_F051K8U.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F051K8U.upload.maximum_data_size=8192
GenF0.menu.pnum.GENERIC_F051K8U.build.board=GENERIC_F051K8U
GenF0.menu.pnum.GENERIC_F051K8U.build.product_line=STM32F051x8
GenF0.menu.pnum.GENERIC_F051K8U.build.variant=STM32F0xx/Generic_F051KxU

# Generic F070CB
GenF0.menu.pnum.GENERIC_F070CB=Generic F070CB
GenF0.menu.pnum.GENERIC_F070CB.upload.maximum_size=122880
GenF0.menu.pnum.GENERIC_F070CB.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F070CB.build.board=GENERIC_F070CB
GenF0.menu.pnum.GENERIC_F070CB.build.product_line=STM32F070xB
GenF0.menu.pnum.GENERIC_F070CB.build.variant=STM32F0xx/Generic_F070CB

# Generic F070RB
GenF0.menu.pnum.GENERIC_F070RB=Generic F070RB
GenF0.menu.pnum.GENERIC_F070RB.upload.maximum_size=122880
GenF0.menu.pnum.GENERIC_F070RB.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F070RB.build.board=GENERIC_F070RB
GenF0.menu.pnum.GENERIC_F070RB.build.product_line=STM32F070xB
GenF0.menu.pnum.GENERIC_F070RB.build.variant=STM32F0xx/Generic_F070RB

# Generic F072C8
GenF0.menu.pnum.GENERIC_F072C8=Generic F072C8
GenF0.menu.pnum.GENERIC_F072C8.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072C8.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072C8.build.board=GENERIC_F072C8
GenF0.menu.pnum.GENERIC_F072C8.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072C8.build.variant=STM32F0xx/Generic_F072Cx

# Generic F072CB
GenF0.menu.pnum.GENERIC_F072CB=Generic F072CB
GenF0.menu.pnum.GENERIC_F072CB.upload.maximum_size=131072
GenF0.menu.pnum.GENERIC_F072CB.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072CB.build.board=GENERIC_F072CB
GenF0.menu.pnum.GENERIC_F072CB.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072CB.build.variant=STM32F0xx/Generic_F072Cx

# Generic F072R8
GenF0.menu.pnum.GENERIC_F072R8=Generic F072R8
GenF0.menu.pnum.GENERIC_F072R8.upload.maximum_size=65536
GenF0.menu.pnum.GENERIC_F072R8.upload.maximum_data_size=16384
GenF0.menu.pnum.GENERIC_F072R8.build.board=GENERIC_F072R8
GenF0.menu.pnum.GENERIC_F072R8.build.product_line=STM32F072xB
GenF0.menu.pnum.GENERIC_F072R8.build.variant=STM32F0xx/Generic_F072Rx

# Generic F072RB
GenF0.menu.pnum.Generic_F072RB=Generic F072RB
GenF0.menu.pnum.Generic_F072RB.upload.maximum_size=131072
GenF0.menu.pnum.Generic_F072RB.upload.maximum_data_size=16384
GenF0.menu.pnum.Generic_F072RB.build.board=GENERIC_F072RB
GenF0.menu.pnum.Generic_F072RB.build.product_line=STM32F072xB
GenF0.menu.pnum.Generic_F072RB.build.variant=STM32F0xx/Generic_F072Rx

# Generic F091RB
GenF0.menu.pnum.Generic_F091RB=Generic F091RB
GenF0.menu.pnum.Generic_F091RB.upload.maximum_size=131072
GenF0.menu.pnum.Generic_F091RB.upload.maximum_data_size=32768
GenF0.menu.pnum.Generic_F091RB.build.board=GENERIC_F091RB
GenF0.menu.pnum.Generic_F091RB.build.product_line=STM32F091xC
GenF0.menu.pnum.Generic_F091RB.build.variant=STM32F0xx/Generic_F091Rx

# Generic F091RC
GenF0.menu.pnum.Generic_F091RC=Generic F091RC
GenF0.menu.pnum.Generic_F091RC.upload.maximum_size=262144
GenF0.menu.pnum.Generic_F091RC.upload.maximum_data_size=32768
GenF0.menu.pnum.Generic_F091RC.build.board=GENERIC_F091RC
GenF0.menu.pnum.Generic_F091RC.build.product_line=STM32F091xC
GenF0.menu.pnum.Generic_F091RC.build.variant=STM32F0xx/Generic_F091Rx

# Upload menu
GenF0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenF0.menu.upload_method.swdMethod.upload.protocol=0
GenF0.menu.upload_method.swdMethod.upload.options=-g
GenF0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenF0.menu.upload_method.serialMethod.upload.protocol=1
GenF0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenF0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenF0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenF0.menu.upload_method.dfuMethod.upload.protocol=2
GenF0.menu.upload_method.dfuMethod.upload.options=-g
GenF0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic F1
GenF1.name=Generic STM32F1 series

GenF1.build.core=arduino
GenF1.build.board=GenF1
GenF1.build.mcu=cortex-m3
GenF1.build.series=STM32F1xx
GenF1.build.cmsis_lib_gcc=arm_cortexM3l_math
GenF1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}

# BLUEPILL_F103C6 board
GenF1.menu.pnum.BLUEPILL_F103C6=BluePill F103C6 (32K)
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_size=32768
GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_data_size=10240
GenF1.menu.pnum.BLUEPILL_F103C6.build.board=BLUEPILL_F103C6
GenF1.menu.pnum.BLUEPILL_F103C6.build.product_line=STM32F103x6
GenF1.menu.pnum.BLUEPILL_F103C6.build.variant=STM32F1xx/PILL_F103XX

