ABOSTM/Arduino_Core_STM32/boards.txt
# Generic G031K8
GenG0.menu.pnum.GENERIC_G031K8=Generic G031K8
GenG0.menu.pnum.GENERIC_G031K8.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G031K8.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G031K8.build.board=GENERIC_G031K8
GenG0.menu.pnum.GENERIC_G031K8.build.product_line=STM32G031xx
GenG0.menu.pnum.GENERIC_G031K8.build.variant=STM32G0xx/Generic_G031Kx

# Generic G071R6
GenG0.menu.pnum.GENERIC_G071R6=Generic G071R6
GenG0.menu.pnum.GENERIC_G071R6.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G071R6.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R6.build.board=GENERIC_G071R6
GenG0.menu.pnum.GENERIC_G071R6.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R6.build.variant=STM32G0xx/Generic_G071Rx

# Generic G071R8
GenG0.menu.pnum.GENERIC_G071R8=Generic G071R8
GenG0.menu.pnum.GENERIC_G071R8.upload.maximum_size=65536
GenG0.menu.pnum.GENERIC_G071R8.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071R8.build.board=GENERIC_G071R8
GenG0.menu.pnum.GENERIC_G071R8.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071R8.build.variant=STM32G0xx/Generic_G071Rx

# Generic G071RB
GenG0.menu.pnum.GENERIC_G071RB=Generic G071RB
GenG0.menu.pnum.GENERIC_G071RB.upload.maximum_size=131072
GenG0.menu.pnum.GENERIC_G071RB.upload.maximum_data_size=36864
GenG0.menu.pnum.GENERIC_G071RB.build.board=GENERIC_G071RB
GenG0.menu.pnum.GENERIC_G071RB.build.product_line=STM32G071xx
GenG0.menu.pnum.GENERIC_G071RB.build.variant=STM32G0xx/Generic_G071Rx

# Upload menu
GenG0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG0.menu.upload_method.swdMethod.upload.protocol=0
GenG0.menu.upload_method.swdMethod.upload.options=-g
GenG0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG0.menu.upload_method.serialMethod.upload.protocol=1
GenG0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenG0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG0.menu.upload_method.dfuMethod.upload.protocol=2
GenG0.menu.upload_method.dfuMethod.upload.options=-g
GenG0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg


################################################################################
# Generic G4
GenG4.name=Generic STM32G4 series

GenG4.build.core=arduino
GenG4.build.board=GenG4
GenG4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenG4.build.mcu=cortex-m4
GenG4.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenG4.build.series=STM32G4xx
GenG4.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Generic G431KB board
GenG4.menu.pnum.GENERIC_G431KB=Generic G431KB
GenG4.menu.pnum.GENERIC_G431KB.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431KB.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431KB.build.board=GENERIC_G431KB
GenG4.menu.pnum.GENERIC_G431KB.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431KB.build.variant=STM32G4xx/Generic_G431KB

# Generic G431RB board
GenG4.menu.pnum.GENERIC_G431RB=Generic G431RB
GenG4.menu.pnum.GENERIC_G431RB.upload.maximum_size=131072
GenG4.menu.pnum.GENERIC_G431RB.upload.maximum_data_size=32768
GenG4.menu.pnum.GENERIC_G431RB.build.board=GENERIC_G431RB
GenG4.menu.pnum.GENERIC_G431RB.build.product_line=STM32G431xx
GenG4.menu.pnum.GENERIC_G431RB.build.variant=STM32G4xx/Generic_G431RB

# Generic G474RE board
GenG4.menu.pnum.GENERIC_G474RE=Generic G474RE
GenG4.menu.pnum.GENERIC_G474RE.upload.maximum_size=524288
GenG4.menu.pnum.GENERIC_G474RE.upload.maximum_data_size=131072
GenG4.menu.pnum.GENERIC_G474RE.build.board=GENERIC_G474RE
GenG4.menu.pnum.GENERIC_G474RE.build.product_line=STM32G474xx
GenG4.menu.pnum.GENERIC_G474RE.build.variant=STM32G4xx/Generic_G474RE

# Upload menu
GenG4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenG4.menu.upload_method.swdMethod.upload.protocol=0
GenG4.menu.upload_method.swdMethod.upload.options=-g
GenG4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenG4.menu.upload_method.serialMethod.upload.protocol=1
GenG4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenG4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenG4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenG4.menu.upload_method.dfuMethod.upload.protocol=2
GenG4.menu.upload_method.dfuMethod.upload.options=-g
GenG4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg


################################################################################
# Generic H7
GenH7.name=Generic STM32H7 Series

GenH7.build.core=arduino
GenH7.build.board=GenH7
GenH7.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenH7.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
GenH7.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenH7.build.series=STM32H7xx
GenH7.build.mcu=cortex-m7

# Daisy Seed board
GenH7.menu.pnum.DAISY_SEED=Daisy Seed
GenH7.menu.pnum.DAISY_SEED.upload.maximum_size=131072
GenH7.menu.pnum.DAISY_SEED.upload.maximum_data_size=524288
GenH7.menu.pnum.DAISY_SEED.build.board=DAISY_SEED
GenH7.menu.pnum.DAISY_SEED.build.product_line=STM32H750xx
GenH7.menu.pnum.DAISY_SEED.build.variant=STM32H7xx/Generic_H750IBK
GenH7.menu.pnum.DAISY_SEED.build.ldscript=DAISY_SEED.ld

# Generic H743ZG board
GenH7.menu.pnum.GENERIC_H743ZG=Generic H743ZG
GenH7.menu.pnum.GENERIC_H743ZG.upload.maximum_size=1048576
GenH7.menu.pnum.GENERIC_H743ZG.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743ZG.build.board=GENERIC_H743ZG
GenH7.menu.pnum.GENERIC_H743ZG.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743ZG.build.variant=STM32H7xx/Generic_H743Zx

# Generic H743ZI board
GenH7.menu.pnum.GENERIC_H743ZI=Generic H743ZI
GenH7.menu.pnum.GENERIC_H743ZI.upload.maximum_size=2097152
GenH7.menu.pnum.GENERIC_H743ZI.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H743ZI.build.board=GENERIC_H743ZI
GenH7.menu.pnum.GENERIC_H743ZI.build.product_line=STM32H743xx
GenH7.menu.pnum.GENERIC_H743ZI.build.variant=STM32H7xx/Generic_H743Zx

# Generic H750IBK board
GenH7.menu.pnum.GENERIC_H750IBK=Generic H750IBK
GenH7.menu.pnum.GENERIC_H750IBK.upload.maximum_size=131072
GenH7.menu.pnum.GENERIC_H750IBK.upload.maximum_data_size=524288
GenH7.menu.pnum.GENERIC_H750IBK.build.board=GENERIC_H750IBK
GenH7.menu.pnum.GENERIC_H750IBK.build.product_line=STM32H750xx
GenH7.menu.pnum.GENERIC_H750IBK.build.variant=STM32H7xx/Generic_H750IBK

# Upload menu
GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenH7.menu.upload_method.swdMethod.upload.protocol=0
GenH7.menu.upload_method.swdMethod.upload.options=-g
GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenH7.menu.upload_method.serialMethod.upload.protocol=1
GenH7.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenH7.menu.upload_method.dfuMethod.upload.protocol=2
GenH7.menu.upload_method.dfuMethod.upload.options=-g
GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
################################
# Generic G0
GenG0.name=Generic STM32G0 series

GenG0.build.core=arduino
GenG0.build.board=GenG0
GenG0.build.mcu=cortex-m0plus
GenG0.build.series=STM32G0xx
GenG0.build.cmsis_lib_gcc=arm_cortexM0l_math
GenG0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0

