ABOSTM/Arduino_Core_STM32/boards.txt
# Generic G030K6
GenG0.menu.pnum.GENERIC_G030K6=Generic G030K6
GenG0.menu.pnum.GENERIC_G030K6.upload.maximum_size=32768
GenG0.menu.pnum.GENERIC_G030K6.upload.maximum_data_size=8192
GenG0.menu.pnum.GENERIC_G030K6.build.board=GENERIC_G030K6
GenG0.menu.pnum.GENERIC_G030K6.build.product_line=STM32G030xx
GenG0.menu.pnum.GENERIC_G030K6.build.variant=STM32G0xx/Generic_G030Kx

GenL0.name=Generic STM32L0 series

GenL0.build.core=arduino
GenL0.build.board=GenL0
GenL0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
GenL0.build.mcu=cortex-m0plus
GenL0.build.series=STM32L0xx
GenL0.build.cmsis_lib_gcc=arm_cortexM0l_math

# ThunderPack
GenL0.menu.pnum.THUNDERPACK_L072=ThunderPack v1.0
GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_size=196608
GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_data_size=20480
GenL0.menu.pnum.THUNDERPACK_L072.build.board=THUNDERPACK_L072
GenL0.menu.pnum.THUNDERPACK_L072.build.product_line=STM32L072xx
GenL0.menu.pnum.THUNDERPACK_L072.build.variant=STM32L0xx/THUNDERPACK

# Piconomix PX-HER0 board
GenL0.menu.pnum.PX_HER0=PX-HER0
GenL0.menu.pnum.PX_HER0.upload.maximum_size=131072
GenL0.menu.pnum.PX_HER0.upload.maximum_data_size=20480
GenL0.menu.pnum.PX_HER0.build.board=PX_HER0
GenL0.menu.pnum.PX_HER0.build.product_line=STM32L072xx
GenL0.menu.pnum.PX_HER0.build.variant=STM32L0xx/PX_HER0

# Upload menu
GenL0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL0.menu.upload_method.swdMethod.upload.protocol=0
GenL0.menu.upload_method.swdMethod.upload.options=-g
GenL0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL0.menu.upload_method.serialMethod.upload.protocol=1
GenL0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL0.menu.upload_method.dfuMethod.upload.protocol=2
GenL0.menu.upload_method.dfuMethod.upload.options=-g
GenL0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

GenL0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
GenL0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
GenL0.menu.upload_method.bmpMethod.upload.tool=bmp_upload

################################################################################
# Generic L1
GenL1.name=Generic STM32L1 series

GenL1.build.core=arduino
GenL1.build.board=GenL1
GenL1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL1.build.mcu=cortex-m3
GenL1.build.series=STM32L1xx
GenL1.build.cmsis_lib_gcc=arm_cortexM3l_math

# Generic L151C6 board
GenL1.menu.pnum.GENERIC_L151C6=Generic L151C6
GenL1.menu.pnum.GENERIC_L151C6.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C6.build.board=GENERIC_L151C6
GenL1.menu.pnum.GENERIC_L151C6.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C6.build.variant=STM32L1xx/Generic_L151Cx

# Generic L151C8 board
GenL1.menu.pnum.GENERIC_L151C8=Generic L151C8
GenL1.menu.pnum.GENERIC_L151C8.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L151C8.upload.maximum_data_size=10240
GenL1.menu.pnum.GENERIC_L151C8.build.board=GENERIC_L151C8
GenL1.menu.pnum.GENERIC_L151C8.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151C8.build.variant=STM32L1xx/Generic_L151Cx

# Generic L151CB board
GenL1.menu.pnum.GENERIC_L151CB=Generic L151CB
GenL1.menu.pnum.GENERIC_L151CB.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L151CB.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L151CB.build.board=GENERIC_L151CB
GenL1.menu.pnum.GENERIC_L151CB.build.product_line=STM32L151xB
GenL1.menu.pnum.GENERIC_L151CB.build.variant=STM32L1xx/Generic_L151Cx

# Generic L151C6-A board
GenL1.menu.pnum.GENERIC_L151C6_A=Generic L151C6-A
GenL1.menu.pnum.GENERIC_L151C6_A.upload.maximum_size=32768
GenL1.menu.pnum.GENERIC_L151C6_A.upload.maximum_data_size=16384
GenL1.menu.pnum.GENERIC_L151C6_A.build.board=GENERIC_L151C6_A
GenL1.menu.pnum.GENERIC_L151C6_A.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151C6_A.build.variant=STM32L1xx/Generic_L151Cx

# Generic L151C8-A board
GenL1.menu.pnum.GENERIC_L151C8_A=Generic L151C8-A
GenL1.menu.pnum.GENERIC_L151C8_A.upload.maximum_size=65536
GenL1.menu.pnum.GENERIC_L151C8_A.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L151C8_A.build.board=GENERIC_L151C8_A
GenL1.menu.pnum.GENERIC_L151C8_A.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151C8_A.build.variant=STM32L1xx/Generic_L151Cx

# Generic L151CB-A board
GenL1.menu.pnum.GENERIC_L151CB_A=Generic L151CB-A
GenL1.menu.pnum.GENERIC_L151CB_A.upload.maximum_size=131072
GenL1.menu.pnum.GENERIC_L151CB_A.upload.maximum_data_size=32768
GenL1.menu.pnum.GENERIC_L151CB_A.build.board=GENERIC_L151CB_A
GenL1.menu.pnum.GENERIC_L151CB_A.build.product_line=STM32L151xBA
GenL1.menu.pnum.GENERIC_L151CB_A.build.variant=STM32L1xx/Generic_L151Cx

# Generic L152RE board
GenL1.menu.pnum.GENERIC_L152RE=Generic L152RE
GenL1.menu.pnum.GENERIC_L152RE.upload.maximum_size=524288
GenL1.menu.pnum.GENERIC_L152RE.upload.maximum_data_size=81920
GenL1.menu.pnum.GENERIC_L152RE.build.board=GENERIC_L152RE
GenL1.menu.pnum.GENERIC_L152RE.build.product_line=STM32L152xE
GenL1.menu.pnum.GENERIC_L152RE.build.variant=STM32L1xx/Generic_L152RE

# Upload menu
GenL1.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL1.menu.upload_method.swdMethod.upload.protocol=0
GenL1.menu.upload_method.swdMethod.upload.options=-g
GenL1.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL1.menu.upload_method.serialMethod.upload.protocol=1
GenL1.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL1.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL1.menu.upload_method.dfuMethod.upload.protocol=2
GenL1.menu.upload_method.dfuMethod.upload.options=-g
GenL1.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic L4
GenL4.name=Generic STM32L4 series

GenL4.build.core=arduino
GenL4.build.board=GenL4
GenL4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL4.build.mcu=cortex-m4
GenL4.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenL4.build.series=STM32L4xx
GenL4.build.cmsis_lib_gcc=arm_cortexM4lf_math

