ABOSTM/Arduino_Core_STM32/boards.txt
# Generic L412KB board
GenL4.menu.pnum.GENERIC_L412KB=Generic L412KB
GenL4.menu.pnum.GENERIC_L412KB.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L412KB.upload.maximum_data_size=40960
GenL4.menu.pnum.GENERIC_L412KB.build.board=GENERIC_L412KB
GenL4.menu.pnum.GENERIC_L412KB.build.product_line=STM32L412xx
GenL4.menu.pnum.GENERIC_L412KB.build.variant=STM32L4xx/Generic_L412KB

# Generic L432KB board
GenL4.menu.pnum.GENERIC_L432KB=Generic L432KB
GenL4.menu.pnum.GENERIC_L432KB.upload.maximum_size=131072
GenL4.menu.pnum.GENERIC_L432KB.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L432KB.build.board=GENERIC_L432KB
GenL4.menu.pnum.GENERIC_L432KB.build.product_line=STM32L432xx
GenL4.menu.pnum.GENERIC_L432KB.build.variant=STM32L4xx/Generic_L432Kx

# Generic L432KC board
GenL4.menu.pnum.GENERIC_L432KC=Generic L432KC
GenL4.menu.pnum.GENERIC_L432KC.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L432KC.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L432KC.build.board=GENERIC_L432KC
GenL4.menu.pnum.GENERIC_L432KC.build.product_line=STM32L432xx
GenL4.menu.pnum.GENERIC_L432KC.build.variant=STM32L4xx/Generic_L432Kx

# Generic L433RC_P board
GenL4.menu.pnum.GENERIC_L433RC_P=Generic L433RC-P
GenL4.menu.pnum.GENERIC_L433RC_P.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L433RC_P.upload.maximum_data_size=65536
GenL4.menu.pnum.GENERIC_L433RC_P.build.board=GENERIC_L433RC_P
GenL4.menu.pnum.GENERIC_L433RC_P.build.product_line=STM32L433xx
GenL4.menu.pnum.GENERIC_L433RC_P.build.variant=STM32L4xx/Generic_L433RC_P

# Generic L452RC board
GenL4.menu.pnum.GENERIC_L452RC=Generic L452RC
GenL4.menu.pnum.GENERIC_L452RC.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L452RC.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RC.build.board=GENERIC_L452RC
GenL4.menu.pnum.GENERIC_L452RC.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RC.build.variant=STM32L4xx/Generic_L452Rx

# Generic L452RE board
GenL4.menu.pnum.GENERIC_L452RE=Generic L452RE
GenL4.menu.pnum.GENERIC_L452RE.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452RE.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RE.build.board=GENERIC_L452RE
GenL4.menu.pnum.GENERIC_L452RE.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RE.build.variant=STM32L4xx/Generic_L452Rx

# Generic L452RE_P board
GenL4.menu.pnum.GENERIC_L452RE_P=Generic L452RE_P
GenL4.menu.pnum.GENERIC_L452RE_P.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L452RE_P.upload.maximum_data_size=163840
GenL4.menu.pnum.GENERIC_L452RE_P.build.board=GENERIC_L452RE_P
GenL4.menu.pnum.GENERIC_L452RE_P.build.product_line=STM32L452xx
GenL4.menu.pnum.GENERIC_L452RE_P.build.variant=STM32L4xx/Generic_L452RE_P

# Generic L475VC board
GenL4.menu.pnum.GENERIC_L475VC=Generic L475VC
GenL4.menu.pnum.GENERIC_L475VC.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L475VC.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VC.build.board=GENERIC_L475VC
GenL4.menu.pnum.GENERIC_L475VC.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VC.build.variant=STM32L4xx/Generic_L475Vx

# Generic L475VE board
GenL4.menu.pnum.GENERIC_L475VE=Generic L475VE
GenL4.menu.pnum.GENERIC_L475VE.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L475VE.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VE.build.board=GENERIC_L475VE
GenL4.menu.pnum.GENERIC_L475VE.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VE.build.variant=STM32L4xx/Generic_L475Vx

# Generic L475VG board
GenL4.menu.pnum.GENERIC_L475VG=Generic L475VG
GenL4.menu.pnum.GENERIC_L475VG.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L475VG.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L475VG.build.board=GENERIC_L475VG
GenL4.menu.pnum.GENERIC_L475VG.build.product_line=STM32L475xx
GenL4.menu.pnum.GENERIC_L475VG.build.variant=STM32L4xx/Generic_L475Vx

# Generic L476RC board
GenL4.menu.pnum.GENERIC_L476RC=Generic L476RC
GenL4.menu.pnum.GENERIC_L476RC.upload.maximum_size=262144
GenL4.menu.pnum.GENERIC_L476RC.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RC.build.board=GENERIC_L476RC
GenL4.menu.pnum.GENERIC_L476RC.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RC.build.variant=STM32L4xx/Generic_L476Rx

# Generic L476RE board
GenL4.menu.pnum.GENERIC_L476RE=Generic L476RE
GenL4.menu.pnum.GENERIC_L476RE.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L476RE.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RE.build.board=GENERIC_L476RE
GenL4.menu.pnum.GENERIC_L476RE.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RE.build.variant=STM32L4xx/Generic_L476Rx

# Generic L476RG board
GenL4.menu.pnum.GENERIC_L476RG=Generic L476RG
GenL4.menu.pnum.GENERIC_L476RG.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L476RG.upload.maximum_data_size=98304
GenL4.menu.pnum.GENERIC_L476RG.build.board=GENERIC_L476RG
GenL4.menu.pnum.GENERIC_L476RG.build.product_line=STM32L476xx
GenL4.menu.pnum.GENERIC_L476RG.build.variant=STM32L4xx/Generic_L476Rx

# Generic L496ZE board
GenL4.menu.pnum.GENERIC_L496ZE=Generic L496ZE
GenL4.menu.pnum.GENERIC_L496ZE.upload.maximum_size=524288
GenL4.menu.pnum.GENERIC_L496ZE.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZE.build.board=GENERIC_L496ZE
GenL4.menu.pnum.GENERIC_L496ZE.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZE.build.variant=STM32L4xx/Generic_L496Zx

# Generic L496ZG board
GenL4.menu.pnum.GENERIC_L496ZG=Generic L496ZG
GenL4.menu.pnum.GENERIC_L496ZG.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L496ZG.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZG.build.board=GENERIC_L496ZG
GenL4.menu.pnum.GENERIC_L496ZG.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZG.build.variant=STM32L4xx/Generic_L496Zx

# Generic L496ZG-P board
GenL4.menu.pnum.GENERIC_L496ZG_P=Generic L496ZG-P
GenL4.menu.pnum.GENERIC_L496ZG_P.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L496ZG_P.upload.maximum_data_size=327680
GenL4.menu.pnum.GENERIC_L496ZG_P.build.board=GENERIC_L496ZG_P
GenL4.menu.pnum.GENERIC_L496ZG_P.build.product_line=STM32L496xx
GenL4.menu.pnum.GENERIC_L496ZG_P.build.variant=STM32L4xx/Generic_L496ZG_P

# Generic L4R5ZGT board
GenL4.menu.pnum.GENERIC_L4R5ZGT=Generic L4R5ZGT
GenL4.menu.pnum.GENERIC_L4R5ZGT.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R5ZGT.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZGT.build.board=GENERIC_L4R5ZGT
GenL4.menu.pnum.GENERIC_L4R5ZGT.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZGT.build.variant=STM32L4xx/Generic_L4R5ZxT

# Generic L4R5ZIT board
GenL4.menu.pnum.GENERIC_L4R5ZIT=Generic L4R5ZIT
GenL4.menu.pnum.GENERIC_L4R5ZIT.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZIT.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZIT.build.board=GENERIC_L4R5ZIT
GenL4.menu.pnum.GENERIC_L4R5ZIT.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZIT.build.variant=STM32L4xx/Generic_L4R5ZxT

# Generic L4R5ZI_P board
GenL4.menu.pnum.GENERIC_L4R5ZI_P=Generic L4R5ZI-P
GenL4.menu.pnum.GENERIC_L4R5ZI_P.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R5ZI_P.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R5ZI_P.build.board=GENERIC_L4R5ZI_P
GenL4.menu.pnum.GENERIC_L4R5ZI_P.build.product_line=STM32L4R5xx
GenL4.menu.pnum.GENERIC_L4R5ZI_P.build.variant=STM32L4xx/Generic_L4R5ZI_P

