ABOSTM/Arduino_Core_STM32/boards.txt
# Generic L4R9ZGJ board
GenL4.menu.pnum.GENERIC_L4R9ZGJ=Generic L4R9ZGJ
GenL4.menu.pnum.GENERIC_L4R9ZGJ.upload.maximum_size=1048576
GenL4.menu.pnum.GENERIC_L4R9ZGJ.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZGJ.build.board=GENERIC_L4R9ZGJ
GenL4.menu.pnum.GENERIC_L4R9ZGJ.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZGJ.build.variant=STM32L4xx/Generic_L4R9ZxJ

# Generic L4R9ZIJ board
GenL4.menu.pnum.GENERIC_L4R9ZIJ=Generic L4R9ZIJ
GenL4.menu.pnum.GENERIC_L4R9ZIJ.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4R9ZIJ.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4R9ZIJ.build.board=GENERIC_L4R9ZIJ
GenL4.menu.pnum.GENERIC_L4R9ZIJ.build.product_line=STM32L4R9xx
GenL4.menu.pnum.GENERIC_L4R9ZIJ.build.variant=STM32L4xx/Generic_L4R9ZxJ

# Generic L4S5VI board
GenL4.menu.pnum.GENERIC_L4S5VI=Generic L4S5VI
GenL4.menu.pnum.GENERIC_L4S5VI.upload.maximum_size=2097152
GenL4.menu.pnum.GENERIC_L4S5VI.upload.maximum_data_size=655360
GenL4.menu.pnum.GENERIC_L4S5VI.build.board=GENERIC_L4S5VI
GenL4.menu.pnum.GENERIC_L4S5VI.build.product_line=STM32L4S5xx
GenL4.menu.pnum.GENERIC_L4S5VI.build.variant=STM32L4xx/Generic_L4S5VI

# Upload menu
GenL4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL4.menu.upload_method.swdMethod.upload.protocol=0
GenL4.menu.upload_method.swdMethod.upload.options=-g
GenL4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL4.menu.upload_method.serialMethod.upload.protocol=1
GenL4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL4.menu.upload_method.dfuMethod.upload.protocol=2
GenL4.menu.upload_method.dfuMethod.upload.options=-g
GenL4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Generic L5
GenL5.name=Generic STM32L5 series

GenL5.build.core=arduino
GenL5.build.board=GenL5
GenL5.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenL5.build.mcu=cortex-m33
GenL5.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenL5.build.series=STM32L5xx
GenL5.build.cmsis_lib_gcc=arm_ARMv8MMLlfsp_math

# Generic L552ZC-Q board
GenL5.menu.pnum.GENERIC_L552ZC_Q=Generic L552ZC-Q
GenL5.menu.pnum.GENERIC_L552ZC_Q.upload.maximum_size=262144
GenL5.menu.pnum.GENERIC_L552ZC_Q.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L552ZC_Q.build.board=GENERIC_L552ZC_Q
GenL5.menu.pnum.GENERIC_L552ZC_Q.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552ZC_Q.build.variant=STM32L5xx/Generic_L552ZxT_Q

# Generic L552ZE-Q board
GenL5.menu.pnum.GENERIC_L552ZE_Q=Generic L552ZE-Q
GenL5.menu.pnum.GENERIC_L552ZE_Q.upload.maximum_size=524288
GenL5.menu.pnum.GENERIC_L552ZE_Q.upload.maximum_data_size=196608
GenL5.menu.pnum.GENERIC_L552ZE_Q.build.board=GENERIC_L552ZE_Q
GenL5.menu.pnum.GENERIC_L552ZE_Q.build.product_line=STM32L552xx
GenL5.menu.pnum.GENERIC_L552ZE_Q.build.variant=STM32L5xx/Generic_L552ZxT_Q

# Upload menu
GenL5.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenL5.menu.upload_method.swdMethod.upload.protocol=0
GenL5.menu.upload_method.swdMethod.upload.options=-g
GenL5.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenL5.menu.upload_method.serialMethod.upload.protocol=1
GenL5.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenL5.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenL5.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenL5.menu.upload_method.dfuMethod.upload.protocol=2
GenL5.menu.upload_method.dfuMethod.upload.options=-g
GenL5.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

#################################################################################
## Generic MP1 microprocessor series (MPU + MCU)
#GenMP1.name=Generic STM32MP1 series coprocessor
#
#GenMP1.build.core=arduino
#GenMP1.build.board=GenMP1
#GenMP1.build.mcu=cortex-m4
#GenMP1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
#GenMP1.build.series=STM32MP1xx
#GenMP1.build.cmsis_lib_gcc=arm_cortexM4l_math
#GenMP1.build.extra_flags=-DCORE_CM4 -D{build.product_line} {build.enable_virtio} {build.xSerial}
#
## Generic MP157AAC board
#GenMP1.menu.pnum.GENERIC_MP157AAC=Generic MP157AAC
#GenMP1.menu.pnum.GENERIC_MP157AAC.upload.maximum_size=131072
#GenMP1.menu.pnum.GENERIC_MP157AAC.upload.maximum_data_size=131072
#GenMP1.menu.pnum.GENERIC_MP157AAC.build.board=GENERIC_MP157AAC
#GenMP1.menu.pnum.GENERIC_MP157AAC.build.product_line=STM32MP157Axx
#GenMP1.menu.pnum.GENERIC_MP157AAC.build.variant=STM32MP1xx/STM32MP157xACx
#
## Generic MP157CAC board
#GenMP1.menu.pnum.GENERIC_MP157CAC=Generic MP157CAC
#GenMP1.menu.pnum.GENERIC_MP157CAC.upload.maximum_size=131072
#GenMP1.menu.pnum.GENERIC_MP157CAC.upload.maximum_data_size=131072
#GenMP1.menu.pnum.GENERIC_MP157CAC.build.board=GENERIC_MP157CAC
#GenMP1.menu.pnum.GENERIC_MP157CAC.build.product_line=STM32MP157Cxx
#GenMP1.menu.pnum.GENERIC_MP157CAC.build.variant=STM32MP1xx/STM32MP157xACx
#
## Upload menu
#GenMP1.menu.upload_method.MassStorage=Generate run_arduino.sh (You need to copy this manually)
#GenMP1.menu.upload_method.MassStorage.upload.protocol=
#GenMP1.menu.upload_method.MassStorage.upload.tool=remoteproc_gen

################################################################################
# Generic WB
GenWB.name=Generic STM32WB series

GenWB.build.core=arduino
GenWB.build.board=GenWB
GenWB.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
GenWB.build.mcu=cortex-m4
GenWB.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
GenWB.build.series=STM32WBxx
GenWB.build.cmsis_lib_gcc=arm_cortexM4lf_math

# Generic WB55CC board
GenWB.menu.pnum.GENERIC_WB55CC=Generic WB55CC
GenWB.menu.pnum.GENERIC_WB55CC.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55CC.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55CC.build.board=GENERIC_WB55CC
GenWB.menu.pnum.GENERIC_WB55CC.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CC.build.variant=STM32WBxx/Generic_WB55Cx

# Generic WB55CE board
GenWB.menu.pnum.GENERIC_WB55CE=Generic WB55CE
GenWB.menu.pnum.GENERIC_WB55CE.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55CE.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CE.build.board=GENERIC_WB55CE
GenWB.menu.pnum.GENERIC_WB55CE.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CE.build.variant=STM32WBxx/Generic_WB55Cx

# Generic WB55CG board
GenWB.menu.pnum.GENERIC_WB55CG=Generic WB55CG
GenWB.menu.pnum.GENERIC_WB55CG.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55CG.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55CG.build.board=GENERIC_WB55CG
GenWB.menu.pnum.GENERIC_WB55CG.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55CG.build.variant=STM32WBxx/Generic_WB55Cx

# Generic WB55RC board
GenWB.menu.pnum.GENERIC_WB55RC=Generic WB55RC
GenWB.menu.pnum.GENERIC_WB55RC.upload.maximum_size=131072
GenWB.menu.pnum.GENERIC_WB55RC.upload.maximum_data_size=65536
GenWB.menu.pnum.GENERIC_WB55RC.build.board=GENERIC_WB55RC
GenWB.menu.pnum.GENERIC_WB55RC.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RC.build.variant=STM32WBxx/Generic_WB55Rx

# Generic WB55RE board
GenWB.menu.pnum.GENERIC_WB55RE=Generic WB55RE
GenWB.menu.pnum.GENERIC_WB55RE.upload.maximum_size=262144
GenWB.menu.pnum.GENERIC_WB55RE.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55RE.build.board=GENERIC_WB55RE
GenWB.menu.pnum.GENERIC_WB55RE.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RE.build.variant=STM32WBxx/Generic_WB55Rx

# Generic WB55RG board
GenWB.menu.pnum.GENERIC_WB55RG=Generic WB55RG
GenWB.menu.pnum.GENERIC_WB55RG.upload.maximum_size=524288
GenWB.menu.pnum.GENERIC_WB55RG.upload.maximum_data_size=196608
GenWB.menu.pnum.GENERIC_WB55RG.build.board=GENERIC_WB55RG
GenWB.menu.pnum.GENERIC_WB55RG.build.product_line=STM32WB55xx
GenWB.menu.pnum.GENERIC_WB55RG.build.variant=STM32WBxx/Generic_WB55Rx

# Upload menu
GenWB.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
GenWB.menu.upload_method.swdMethod.upload.protocol=0
GenWB.menu.upload_method.swdMethod.upload.options=-g
GenWB.menu.upload_method.swdMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
GenWB.menu.upload_method.serialMethod.upload.protocol=1
GenWB.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
GenWB.menu.upload_method.serialMethod.upload.tool=stm32CubeProg

GenWB.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
GenWB.menu.upload_method.dfuMethod.upload.protocol=2
GenWB.menu.upload_method.dfuMethod.upload.options=-g
GenWB.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg

################################################################################
# Electronic Speed Controller boards

ESC_board.name=Electronic speed controllers

